### 友情提示：本脚本由 Au3.REGHelper 于 2013/04/09 23:00 自动生成，不保证其正确性，请自行测试 ###
#include <Array.au3>
Local $Result
Local $Str = _
		'"025888","董上卿","重庆啤酒",2226672.02' & @CRLF & _
		'"2025888","董上卿","北方导航",2199265.00' & @CRLF & _
		'"2115023939","吴德彬","光电股份",1261625.00' & @CRLF & _
		'"022246","陈方剑","大杨创世",1110095.01' & @CRLF & _
		'"21119672","李倍","中南建设",881115.00' & @CRLF & _
		'"2022422","何龙全","探路者",791763.74' & @CRLF & _
		'"2422","何龙全","保定天鹅",789689.00' & @CRLF & _
		'"2017564","张书莲","永太科技",616472.00' & @CRLF & _
		'"2106360","王栋","顺络电子",516361.00' & @CRLF & _
		'"2113226","房林","万向钱潮",502478.00' & @CRLF & _
		'这样的一个TXT文档 我应该怎么读取最后一列然后相加呢？？'
MsgBox(0, '原字符串', $Str)
Local $Test = StringRegExp($Str, '\d+\.\d{2}', 3, 1)
If Not @error Then MsgBox(0, '匹配数量: ' & UBound($Test), '其中[0]元素为: ' & $Test[0])
_ArrayDisplay($Test, UBound($Test))
For $i = 0 To UBound($Test) - 1
	$Result += $Test[$i]
Next
MsgBox(0, "结果", $Result)